In [1]:
"""pandas入门"""

'pandas入门'

In [2]:
"""pandas是专门处理表格和混杂数据的，这里混杂数据是啥？nosql吗？"""

'pandas是专门处理表格和混杂数据的，这里混杂数据是啥？nosql吗？'

In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([4,7,-5,3])

In [4]:
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
"""这里需要values和index数量必须一致，否则报错"""
obj2 = pd.Series([1,2,3,4], index = ['a','b','c','d'])
print(obj2)

a    1
b    2
c    3
d    4
dtype: int64

In [12]:
print(obj[2])
print(obj2['d'])

-5
4

In [13]:
print(obj2[obj2 > 2])

c    3
d    4
dtype: int64

In [14]:
obj2 * 2

a    2
b    4
c    6
d    8
dtype: int64

In [16]:
import numpy as np
np.exp(obj2)

a     2.718282
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [17]:
"""这里比较的是index"""
'a' in obj2

True

In [18]:
2 in obj2

False

In [19]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000,'Utah':5000}
obj3 = pd.Series(sdata)
print(obj3)

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [20]:
"""判断每个value的缺失值"""
pd.isnull(obj3)

Ohio      False
Oregon    False
Texas     False
Utah      False
dtype: bool

In [21]:
pd.notnull(obj3)

Ohio      True
Oregon    True
Texas     True
Utah      True
dtype: bool

In [22]:
obj2 + obj3

Ohio     NaN
Oregon   NaN
Texas    NaN
Utah     NaN
a        NaN
b        NaN
c        NaN
d        NaN
dtype: float64

In [23]:
stats = ['California', 'Ohio']
obj4 = pd.Series(sdata, index=stats)
print(obj4)

California        NaN
Ohio          35000.0
dtype: float64

In [24]:
obj3 + obj4

California        NaN
Ohio          70000.0
Oregon            NaN
Texas             NaN
Utah              NaN
dtype: float64

In [25]:
pd.isnull(obj3 + obj4)

California     True
Ohio          False
Oregon         True
Texas          True
Utah           True
dtype: bool

In [26]:
obj4.name = 'population'

In [27]:
obj4.index.name = 'stats'

In [28]:
obj4

stats
California        NaN
Ohio          35000.0
Name: population, dtype: float64

In [29]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [30]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [31]:
"""改变了index"""
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [32]:
"""接下来是dataFrame"""

'接下来是dataFrame'

In [36]:
"""每个map的数组数量必须一致"""
data = {'stat':['Ohio','Ohio','Nevada','Nevada'],'year':[2000,2001,2002,2003],'pop':[1.5, 1.7, 3.6, 2.9]}
print(data)
frame = pd.DataFrame(data)
print(frame)

{'stat': ['Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.9]}
   pop    stat  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6  Nevada  2002
3  2.9  Nevada  2003

In [37]:
frame.head

<bound method NDFrame.head of    pop    stat  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6  Nevada  2002
3  2.9  Nevada  2003>

In [38]:
frame.hist

<bound method hist_frame of    pop    stat  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6  Nevada  2002
3  2.9  Nevada  2003>

In [41]:
frame2 = pd.DataFrame(data ,columns=['year','month'])

In [42]:
frame2

   year month
0  2000   NaN
1  2001   NaN
2  2002   NaN
3  2003   NaN

In [43]:
frame2.columns

Index(['year', 'month'], dtype='object')

In [44]:
frame2.year

0    2000
1    2001
2    2002
3    2003
Name: year, dtype: int64

In [45]:
frame2.day

AttributeError: 'DataFrame' object has no attribute 'day'

In [46]:
frame.month

AttributeError: 'DataFrame' object has no attribute 'month'

In [47]:
frame2.month

0    NaN
1    NaN
2    NaN
3    NaN
Name: month, dtype: object

In [48]:
frame2['day'] = 3

In [49]:
frame2

   year month  day
0  2000   NaN    3
1  2001   NaN    3
2  2002   NaN    3
3  2003   NaN    3

In [53]:
frame2['day'] = np.arange(4.)

In [54]:
frame2

   year month  day
0  2000   NaN  0.0
1  2001   NaN  1.0
2  2002   NaN  2.0
3  2003   NaN  3.0

In [59]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['1', '2','3'])

In [60]:
val

1   -1.2
2   -1.5
3   -1.7
dtype: float64

In [61]:
frame2['day'] = val

In [62]:
frame2

   year month  day
0  2000   NaN  NaN
1  2001   NaN  NaN
2  2002   NaN  NaN
3  2003   NaN  NaN

In [64]:
del frame2['day']

In [65]:
frame2

   year month
0  2000   NaN
1  2001   NaN
2  2002   NaN
3  2003   NaN

In [68]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7}}

In [69]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7}}

In [70]:
frame3 = pd.DataFrame(pop)

In [71]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   NaN

In [72]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   NaN

In [74]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   NaN

In [75]:
obj = pd.Series(range(3), index =['a',  'b', 'c'])

In [76]:
obj

a    0
b    1
c    2
dtype: int64

In [77]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [78]:
index[1:]

Index(['b', 'c'], dtype='object')

In [79]:
index[1] = 'f'

TypeError: Index does not support mutable operations

In [80]:
labels = pd.Index(np.arange(3))

In [81]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [82]:
obj2 = pd.Series([1.5,-2.5,0],index = labels)

In [83]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [84]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [85]:
obj2.index is labels

True

In [86]:
obj3.index is labels

False

In [87]:
frame2

   year month
0  2000   NaN
1  2001   NaN
2  2002   NaN
3  2003   NaN

In [88]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   NaN

In [90]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [91]:
'Ohio' in frame3.columns

True